In [1]:
import pandas as pd

# Series

In [2]:
data = [1,2,3,4,5]

In [3]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index = ["linha" + str(i) for i in range(5)]

In [6]:
index

['linha0', 'linha1', 'linha2', 'linha3', 'linha4']

In [7]:
s = pd.Series(data=data,index=index)

In [8]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [9]:
data = {"linha" + str(i) : i+1for i in range(5)}

In [10]:
data

{'linha0': 1, 'linha1': 2, 'linha2': 3, 'linha3': 4, 'linha4': 5}

In [11]:
s=pd.Series(data)

In [12]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [13]:
s1 = s+2

In [14]:
s1

linha0    3
linha1    4
linha2    5
linha3    6
linha4    7
dtype: int64

In [15]:
s2 = s+s1

In [16]:
s2

linha0     4
linha1     6
linha2     8
linha3    10
linha4    12
dtype: int64

In [17]:
data = [[1,2,3],[4,5,6],[7,8,9]]

In [18]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [19]:
df1 = pd.DataFrame(data=data)

In [20]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [21]:
index = ["linha" + str(i) for i in range(3)]

In [22]:
index

['linha0', 'linha1', 'linha2']

In [72]:
df1 = pd.DataFrame(data=data,index=index)

In [73]:
df1

        0  1  2
linha0  1  2  3
linha1  4  5  6
linha2  7  8  9

In [74]:
columns = ["coluna" + str(i) for i in range(3)]

In [75]:
df1 = pd.DataFrame(data=data,index=index,columns=columns)

In [76]:
df1

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [77]:
# dicionario
data = {'coluna0': {'linha0': 1, 'linha1': 4, 'linha2': 7},
        'coluna1': {'linha0': 2, 'linha1': 5, 'linha2': 8},
        'coluna2': {'linha0': 3, 'linha1': 6, 'linha2': 9}}

In [78]:
df2 = pd.DataFrame(data)

In [79]:
df2

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [80]:
# tuplas
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [81]:
df3 = pd.DataFrame(data=data,index=index,columns=columns)

In [82]:
df3

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [83]:
df1[df1 > 0] = 'A'

In [84]:
df1

       coluna0 coluna1 coluna2
linha0       A       A       A
linha1       A       A       A
linha2       A       A       A

In [85]:
df2[df2 > 0] = 'B'
df2

       coluna0 coluna1 coluna2
linha0       B       B       B
linha1       B       B       B
linha2       B       B       B

In [86]:
df3[df3 > 0] = 'C'

In [93]:
df4 = pd.concat([df1,df2,df3])

In [94]:
df4

       coluna0 coluna1 coluna2
linha0       A       A       A
linha1       A       A       A
linha2       A       A       A
linha0       B       B       B
linha1       B       B       B
linha2       B       B       B
linha0       C       C       C
linha1       C       C       C
linha2       C       C       C

In [95]:
df4 = pd.concat([df1,df2,df3],axis=1)

In [96]:
df4

       coluna0 coluna1 coluna2 coluna0 coluna1 coluna2 coluna0 coluna1 coluna2
linha0       A       A       A       B       B       B       C       C       C
linha1       A       A       A       B       B       B       C       C       C
linha2       A       A       A       B       B       B       C       C       C